On re-run the `metrics_router_settings` updation is not showing so the other updates are expected -


```
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: Terraform used the selected providers to generate the following execution
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: plan. Resource actions are indicated with the following symbols:
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   + create
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   ~ update in-place
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   - destroy
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: Terraform will perform the following actions:
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   # module.event_streams.ibm_event_streams_topic.es_topic[0] will be destroyed
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   # (because resource does not use count)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   - resource "ibm_event_streams_topic" "es_topic" {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - config               = {} -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - id                   = "crn:v1:bluemix:public:messagehub:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:784a4eb2-889f-4a50-983d-bbb9d79cc7fb:topic:obs-upg-lgblfh-topic" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - kafka_brokers_sasl   = [
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-0-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-1-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-2-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-3-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-4-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "broker-5-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         ] -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - kafka_http_url       = "https://3xwbtb07tmj7k4kl.svc02.eu-gb.eventstreams.cloud.ibm.com/" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - name                 = "obs-upg-lgblfh-topic" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - partitions           = 1 -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       - resource_instance_id = "crn:v1:bluemix:public:messagehub:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:784a4eb2-889f-4a50-983d-bbb9d79cc7fb::" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:     }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   # module.event_streams.ibm_event_streams_topic.es_topic["obs-upg-lgblfh-topic"] will be created
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   + resource "ibm_event_streams_topic" "es_topic" {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + config               = {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           + "cleanup.policy"  = "delete"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           + "retention.bytes" = "10485760"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           + "retention.ms"    = "86400000"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           + "segment.bytes"   = "536870912"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + id                   = (known after apply)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + kafka_brokers_sasl   = (known after apply)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + kafka_http_url       = (known after apply)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + name                 = "obs-upg-lgblfh-topic"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + partitions           = 1
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       + resource_instance_id = "crn:v1:bluemix:public:messagehub:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:784a4eb2-889f-4a50-983d-bbb9d79cc7fb::"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:     }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   # module.event_streams.ibm_resource_instance.es_instance will be updated in-place
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   ~ resource "ibm_resource_instance" "es_instance" {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         id                      = "crn:v1:bluemix:public:messagehub:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:784a4eb2-889f-4a50-983d-bbb9d79cc7fb::"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         name                    = "obs-upg-lgblfh-eventsteams-instance"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       ~ parameters              = {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "service-endpoints" = "public" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "storage_size"      = "2048" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           - "throughput"        = "150" -> null
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         tags                    = []
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         # (38 unchanged attributes hidden)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         # (1 unchanged block hidden)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:     }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   # module.observability_instances.module.activity_tracker.ibm_atracker_target.atracker_eventstreams_targets["obs-upg-lgblfh-es-target"] will be updated in-place
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:   ~ resource "ibm_atracker_target" "atracker_eventstreams_targets" {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         id               = "80a8fdcf-e79b-40c6-acc5-056a60516e90"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         name             = "obs-upg-lgblfh-es-target"
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         # (8 unchanged attributes hidden)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:       ~ eventstreams_endpoint {
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:           ~ brokers                    = [
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:               ~ "broker-0-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093" -> "broker-5-3xwbtb07tmj7k4kl.kafka.svc02.eu-gb.eventstreams.cloud.ibm.com:9093",
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:             ]
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:             # (4 unchanged attributes hidden)
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:         }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206:     }
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: 
TestRunUpgradeExample 2025-02-26T09:59:07Z command.go:206: Plan: 1 to add, 2 to change, 1 to destroy.
```